src/DataProcessors/РабочееМестоЗапускСборкаСК/РабочееМестоЗапускСборкаСК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоЗапускСборкаСК</name>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ЭтапСпецификации</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыЭлементовНормРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
        <types>CatalogRef.Документация</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТехОперации</types>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСправочника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>21</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БарКоды/БарКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БарКоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйБарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MAC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодDanfoss</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомерEnLogic</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/РабочееМестоЗапускСборкаСК/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Исполнитель = ПараметрыСеанса.Пользователь;
	Если Объект.Исполнитель.Пустая() Тогда
	Элементы.РабочееМесто.Доступность = Ложь;
	Сообщить("Вы не внесены в справочник Сотрудников! Работа невозможна!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево(ЭтапСпецификации)
Объект.Спецификация.Сортировать("ТипСправочника Убыв,ВидМПЗ,Позиция,МПЗ");
тДерево = РеквизитФормыВЗначение("ДеревоСпецификации");
тДерево.Строки.Очистить();
ТипСпр = "";
	Для каждого ТЧ Из Объект.Спецификация Цикл
		Если ТЧ.ЭтапСпецификации <> ЭтапСпецификации Тогда
		Продолжить;		
		КонецЕсли; 
			Если ТипСпр <> ТЧ.ТипСправочника Тогда
			Стр = тДерево.Строки.Добавить();
			Стр.ТипСправочника = ТЧ.ТипСправочника;
			ТипСпр = ТЧ.ТипСправочника;
			КонецЕсли; 
	СтрЗнч = Стр.Строки.Добавить();
	СтрЗнч.Позиция = ТЧ.Позиция;
	СтрЗнч.ВидЭлемента = ТЧ.ВидМПЗ;
	СтрЗнч.МПЗ = ТЧ.МПЗ;
	СтрЗнч.Количество = ТЧ.Количество;
	СтрЗнч.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;
	СтрЗнч.Аналог = ТЧ.Аналог;
	СтрЗнч.Примечание = ТЧ.Примечание;
		Если ТЧ.Владелец <> Неопределено Тогда
		СтрЗнч.Владелец = ТЧ.Владелец.Элемент;
		КонецЕсли; 		 
	КонецЦикла;
ЗначениеВРеквизитФормы(тДерево, "ДеревоСпецификации");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ЗаполнитьДерево(Элемент.ТекущиеДанные.ЭтапСпецификации);
РазвернутьДерево(Неопределено);
КонецПроцедуры
        
&НаСервере
Функция ПолучитьЗаданиеНаСервере()
Результат = ОбщийМодульАРМ.ПолучитьНезавершенноеЗадание(Этапы,ЭтапыАРМ,Объект.РабочееМесто,Объект.Исполнитель);
	Если Результат <> Неопределено Тогда 
	Объект.ПроизводственноеЗадание = Результат.ПЗ;
	НомерВТ = Результат.ВозвратнаяТара;
	Возврат(1);
	КонецЕсли;
НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
КолПЗ = 0;

СписокИзделийЛО = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаНачала,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто = &РабочееМесто
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.Ремонт = ЛОЖЬ
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование.Статус <> 2";
	Если Объект.РабочееМесто.ОбработкаЗаданийПоВремениПоступления Тогда
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ЭтапыПроизводственныхЗаданийСрезПоследних.Период
									|ИТОГИ ПО ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование";
	Иначе                           
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование.НомерОчереди,
									|ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование.ДатаОтгрузки,
									|ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.Номер
									|ИТОГИ ПО ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование";
	КонецЕсли;
Запрос.УстановитьПараметр("РабочееМесто",Объект.РабочееМесто);
Результат = Запрос.Выполнить();
ВыборкаМТК = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМТК.Следующий() Цикл
	ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолПЗ = КолПЗ + 1;
			Если СписокИзделийЛО.НайтиПоЗначению(ВыборкаДетальныеЗаписи.ПЗ.Изделие) <> Неопределено Тогда
			Прервать; //Переходим к следующей МТК
			КонецЕсли;
				Если Не ОбщийМодульВызовСервера.СоздатьТаблицуЭтаповПроизводства(ВыборкаДетальныеЗаписи.ПЗ,Этапы,ЭтапыАРМ,Объект.РабочееМесто,Объект.Исполнитель) Тогда	
				Прервать; //Переходим к следующей МТК			
				КонецЕсли;
					Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПЗ.ДатаЗапуска) Тогда
					Результат = ОбщийМодульВызовСервера.ЗапуститьВПроизводство(ВыборкаДетальныеЗаписи.ПЗ,Объект.РабочееМесто,Этапы);
						Если Результат = 0 Тогда
						СписокИзделийЛО.Добавить(ВыборкаДетальныеЗаписи.ПЗ.Изделие);
						Прервать; //Переходим к следующей МТК
						ИначеЕсли Результат = -1 Тогда
						Возврат(-1);
						КонецЕсли;
					КонецЕсли; 
		Парам = Новый Структура("РабочееМесто,Исполнитель,ДатаНачала",Объект.РабочееМесто,Объект.Исполнитель,ТекущаяДата());
		ОбщийМодульРаботаСРегистрами.ИзменитьЭтапПроизводственногоЗадания(ВыборкаДетальныеЗаписи.ПЗ,Парам);
		Объект.ПроизводственноеЗадание = ВыборкаДетальныеЗаписи.ПЗ;
		НомерВТ = ВыборкаДетальныеЗаписи.ПЗ.ВозвратнаяТара;
		ОкончаниеЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбщийМодульРаботаСРегистрами.СборИнформацииПоАРМ(1,Объект.РабочееМесто,Объект.ПроизводственноеЗадание.Изделие,КолПЗ,(ОкончаниеЗамера - НачалоЗамера)/1000);
		Возврат(1);
		КонецЦикла;
	КонецЦикла;
ОкончаниеЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
ОбщийМодульРаботаСРегистрами.СборИнформацииПоАРМ(1,Объект.РабочееМесто,Справочники.Номенклатура.ПустаяСсылка(),КолПЗ,(ОкончаниеЗамера - НачалоЗамера)/1000);
Возврат(0);
КонецФункции

&НаСервере
Функция ПолучитьСпецификациюЭтапов()
Возврат(ОбщийМодульАРМ.ПолучитьСпецификациюЭтапов(Объект.ПроизводственноеЗадание,Объект.РабочееМесто,Этапы,Объект.Спецификация,ТаблицаКомплектации)); 
КонецФункции
 
&НаСервере
Процедура ПолучитьДополнительныеКоды()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БарКоды.MAC,
	|	БарКоды.IMEI,
	|	БарКоды.БарКод,
	|	БарКоды.КодDanfoss
	|ИЗ
	|	РегистрСведений.БарКоды КАК БарКоды
	|ГДЕ
	|	БарКоды.БарКод = &БарКод";
Запрос.УстановитьПараметр("БарКод", Объект.ПроизводственноеЗадание.БарКод);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	MAC = ВыборкаДетальныеЗаписи.MAC;
	IMEI = ВыборкаДетальныеЗаписи.IMEI;
	КодDanfoss = ВыборкаДетальныеЗаписи.КодDanfoss;
	КонецЦикла;
Элементы.MAC.Видимость = ЗначениеЗаполнено(MAC);
Элементы.IMEI.Видимость = ЗначениеЗаполнено(IMEI);
Элементы.КодDanfoss.Видимость = ОбщийМодульВызовСервера.ТребуетсяКодDanfoss(Объект.ПроизводственноеЗадание);
КонецПроцедуры 

&НаСервере
Функция ПолучитьКодРабочегоМеста()
Возврат(Объект.РабочееМесто.Код);
КонецФункции 

&НаСервере
Функция НеобходимаВозвратнаяТара()
Возврат(Объект.РабочееМесто.ВозвратнаяТара);
КонецФункции 

&НаСервере
Функция ПолучитьСписокКанбанов()
СписокКанбанов = Новый СписокЗначений;

	Для каждого ТЧ Из ТаблицаКомплектации Цикл
		Если ТипЗнч(ТЧ.Комплектация) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если Не ТЧ.Комплектация.Канбан.Пустая() Тогда
				Если ТЧ.Комплектация.Канбан.СканироватьПриИспользовании Тогда
				СписокКанбанов.Добавить(ТЧ.Комплектация);				
				КонецЕсли;		
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла; 
Возврат(СписокКанбанов);
КонецФункции

&НаСервере
Функция ТаблицаКанбановПустая()
Возврат(?(Объект.ПроизводственноеЗадание.Канбаны.Количество() = 0,Истина,Ложь));
КонецФункции 

&НаКлиенте
Процедура ПолучитьЗадание(Команда)
	Если ОбщийМодульВызовСервера.ЛинейкаОстановлена(ОбщийМодульВызовСервера.ПолучитьЛинейкуПоРабочемуМесту(Объект.РабочееМесто)) Тогда
		Если ПолучитьКодРабочегоМеста() = 1 Тогда
			Если Вопрос("Линейка остановлена! Снять остановку?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Если Не ОбщийМодульРаботаСРегистрами.СнятьОстановкуЛинейки(ОбщийМодульВызовСервера.ПолучитьЛинейкуПоРабочемуМесту(Объект.РабочееМесто)) Тогда	
				Возврат;
				КонецЕсли;
			Иначе
			Возврат;			
			КонецЕсли;
		Иначе
		Возврат; 
		КонецЕсли;
	КонецЕсли;
Состояние("Обработка...",,"Получение задания...");
Результат = ПолучитьЗаданиеНаСервере();
	Если Результат = 1 Тогда
		Если НеобходимаВозвратнаяТара() Тогда
			Если Не ЗначениеЗаполнено(НомерВТ) Тогда			
				Если ВвестиСтроку(НомерВТ,"Введите номер возвратной тары",4) Тогда
					Если Не ОбщийМодульВызовСервера.СохранитьНомерВозвратнойТары(Объект.ПроизводственноеЗадание,НомерВТ) Тогда
					Сообщить("Номер возвратной тары не введён!");
					ОчиститьСсылкуНаПЗ();
					Возврат;
					КонецЕсли;
				Иначе
				Сообщить("Номер возвратной тары не введён!");
				ОчиститьСсылкуНаПЗ();
				Возврат;
				КонецЕсли;			
			КонецЕсли; 		
		КонецЕсли; 
	Иначе
	Сообщить("Нет производственных заданий!");
	Возврат;
	КонецЕсли;
ПолучитьСпецификациюЭтапов();
ПолучитьДополнительныеКоды();
	Если ТаблицаКанбановПустая() Тогда
	СписокКанбанов = ПолучитьСписокКанбанов();
		Если СписокКанбанов.Количество() > 0 Тогда
			Если ОткрытьФормуМодально("ОбщаяФорма.СканированиеКанбанов",Новый Структура("ПроизводственноеЗадание,СписокКанбанов",Объект.ПроизводственноеЗадание,СписокКанбанов)) = Неопределено Тогда
			Сообщить("Канбаны не отсканированы!");
			ОчиститьСсылкуНаПЗ();
			Возврат;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
		Если ТипЗнч(ТаблицаКомплектации[0].Комплектация) = Тип("СправочникСсылка.Номенклатура") Тогда
		Элементы.ТаблицаКомплектации.ТекущаяСтрока = ТаблицаКомплектации[0].ПолучитьИдентификатор();
		ТаблицаКомплектацииВыборЗначения(Элементы.ТаблицаКомплектации,Элементы.ТаблицаКомплектации.ТекущаяСтрока,Истина);
		КонецЕсли;
Элементы.Завершить.КнопкаПоУмолчанию = Истина;
Элементы.ПолучитьЗадание.Доступность = Ложь;
Элементы.Гравировка.Доступность = Истина;
Элементы.ПечатьБарКода.Доступность = Истина;
Элементы.Завершить.Доступность = Истина;
Элементы.Ремонт.Доступность = Истина;
Элементы.Прошивка.Доступность = Истина;
Элементы.ВвестиIMEI.Доступность = ОбщийМодульВызовСервера.ТребуетсяIMEI(Объект.ПроизводственноеЗадание);
Элементы.ВвестиКодDanfoss.Доступность = ОбщийМодульВызовСервера.ТребуетсяКодDanfoss(Объект.ПроизводственноеЗадание);
Элементы.ВвестиMACАдрес.Доступность = ОбщийМодульВызовСервера.ТребуетсяMACАдрес(Объект.ПроизводственноеЗадание);		 
КонецПроцедуры

&НаСервере
Процедура ОчиститьСсылкуНаПЗ()
Объект.ПроизводственноеЗадание = Документы.ПроизводственноеЗадание.ПустаяСсылка();
КодDanfoss = "";
MAC = "";
НомерВТ = "";
Этапы.Очистить();
ЭтапыАРМ.Очистить();
ТаблицаКомплектации.Очистить();
Объект.Спецификация.Очистить();
тДерево = РеквизитФормыВЗначение("ДеревоСпецификации");
тДерево.Строки.Очистить();
ЗначениеВРеквизитФормы(тДерево,"ДеревоСпецификации");
Элементы.ПолучитьЗадание.КнопкаПоУмолчанию = Истина;
Элементы.ПолучитьЗадание.Доступность = Истина;
Элементы.Гравировка.Доступность = Ложь;
Элементы.ПечатьБарКода.Доступность = Ложь;
Элементы.Завершить.Доступность = Ложь;
Элементы.Ремонт.Доступность = Ложь;
Элементы.Прошивка.Доступность = Ложь;
Элементы.ВвестиIMEI.Доступность = Ложь;
Элементы.ВвестиMACАдрес.Доступность = Ложь;
Элементы.ВвестиКодDanfoss.Доступность = Ложь;
КонецПроцедуры  

&НаСервере
Функция МожноРаботатьВАРМ()
	Если ОбщийМодульВызовСервера.МожноВыполнить(Объект.РабочееМесто.Линейка) Тогда	
	Возврат(Истина);
	Иначе
	Объект.РабочееМесто = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
	Сообщить("Работа АРМ запрещена в этой базе!");
	Возврат(Ложь);
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)
	Если Не МожноРаботатьВАРМ() Тогда
	Возврат;
	КонецЕсли;
ПрефиксРМ = ОбщийМодульВызовСервера.ПолучитьПрефиксРабочегоМеста(Объект.РабочееМесто);
	Если ПрефиксРМ = "СБ" Тогда
	Элементы.Прошивка.Видимость = Ложь;
	Элементы.Гравировка.Видимость = Истина;
	Элементы.ПечатьБарКода.Видимость = Истина;
	Элементы.ВвестиIMEI.Видимость = Истина;
	Элементы.ВвестиMACАдрес.Видимость = Истина;
	Элементы.ВвестиКодDanfoss.Видимость = Истина;
	ИначеЕсли ПрефиксРМ = "НЛ" Тогда
	Элементы.Прошивка.Видимость = Истина;
	Элементы.Гравировка.Видимость = Ложь;
	Элементы.ПечатьБарКода.Видимость = Ложь;
	Элементы.ВвестиIMEI.Видимость = Истина;
	Элементы.ВвестиMACАдрес.Видимость = Истина;
	Элементы.ВвестиКодDanfoss.Видимость = Истина;
	ИначеЕсли ПрефиксРМ = "РД" Тогда
	Элементы.Прошивка.Видимость = Истина;
	Элементы.Гравировка.Видимость = Ложь;
	Элементы.ПечатьБарКода.Видимость = Ложь;
	Элементы.ВвестиIMEI.Видимость = Ложь;
	Элементы.ВвестиMACАдрес.Видимость = Ложь;
	Элементы.ВвестиКодDanfoss.Видимость = Ложь;
	Иначе
	Элементы.Прошивка.Видимость = Ложь;
	Элементы.Гравировка.Видимость = Ложь;
	Элементы.ПечатьБарКода.Видимость = Ложь;
	Элементы.ВвестиIMEI.Видимость = Ложь;
	Элементы.ВвестиMACАдрес.Видимость = Ложь;
	Элементы.ВвестиКодDanfoss.Видимость = Ложь;
	КонецЕсли;
ОчиститьСсылкуНаПЗ();
КонецПроцедуры

&НаСервере
Функция ЗавершитьЗаданиеНаСервере()
	Попытка
	ДатаЗавершения = ТекущаяДата();
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	НовоеРабочееМесто = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
	флТекущийЭтапПоследний = Ложь;
	ТекРМ = ЭтапыАРМ.НайтиПоЗначению(Объект.РабочееМесто);
		Если ТекРМ <> Неопределено Тогда
		НомСтр = ЭтапыАРМ.Индекс(ТекРМ)+1;
			Если НомСтр <> ЭтапыАРМ.Количество() Тогда
				Для к = НомСтр По ЭтапыАРМ.Количество()-1 Цикл
					Если ЭтапыАРМ[к].Значение.Авторизовано Тогда
					НовоеРабочееМесто = ЭтапыАРМ[к].Значение;
					Прервать;
					КонецЕсли; 
				КонецЦикла; 	
			Иначе
			флТекущийЭтапПоследний = Истина;			
			КонецЕсли; 
		Иначе
		Сообщить("В списке этапов рабочих мест этого изделия не найдено текущее рабочее место!");
		ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
		Возврат("");		
		КонецЕсли;
			Если НовоеРабочееМесто.Пустая() Тогда
				Если Не флТекущийЭтапПоследний Тогда
				Сообщить("Нет авторизованных рабочих мест!");
				ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
				Возврат("");
				КонецЕсли; 
			Иначе
			ПрефиксРМ = ОбщийМодульВызовСервера.ПолучитьПрефиксРабочегоМеста(НовоеРабочееМесто);
			КонецЕсли;
	НаборЗаписей = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПЗ.Установить(Объект.ПроизводственноеЗадание);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл 
	    	Если Запись.РабочееМесто = Объект.РабочееМесто Тогда
			Запись.ДатаОкончания = ДатаЗавершения;
			Прервать;
			КонецЕсли;  
	    КонецЦикла;
			Если Не флТекущийЭтапПоследний Тогда
			МестоПередачи = "на "+СокрЛП(НовоеРабочееМесто.Наименование);
			ЭПЗ = НаборЗаписей.Добавить();
			ЭПЗ.Период = ДатаЗавершения;
			ЭПЗ.ПЗ = Объект.ПроизводственноеЗадание; 
			ЭПЗ.Линейка = Объект.ПроизводственноеЗадание.Линейка;
			ЭПЗ.Изделие = Объект.ПроизводственноеЗадание.Изделие;
			ЭПЗ.Количество = 1;
			ЭПЗ.БарКод = Объект.ПроизводственноеЗадание.БарКод;
			ЭПЗ.РабочееМесто = НовоеРабочееМесто;
				Если ПрефиксРМ = "СТ" Тогда
				ЭПЗ.ДатаНачала = ДатаЗавершения;	
				ЭПЗ.Исполнитель = НовоеРабочееМесто.Стенд.Исполнитель;	
				СП = РегистрыСведений.СтендовыйПрогон.СоздатьМенеджерЗаписи();
				СП.Период = ДатаЗавершения;
				СП.ПЗ = Объект.ПроизводственноеЗадание;
				СП.Изделие = Объект.ПроизводственноеЗадание.Изделие;
				СП.БарКод = Объект.ПроизводственноеЗадание.БарКод;
				СП.Стенд = НовоеРабочееМесто.Стенд;
				СП.Прогон = 1;
				СП.ИсполнительПоступление = НовоеРабочееМесто.Стенд.Исполнитель;
				СП.ДатаПоступления = ДатаЗавершения;
				СП.ИсполнительПостановка = НовоеРабочееМесто.Стенд.Исполнитель;
				СП.ДатаПостановки = ДатаЗавершения;
				СП.Записать();		
				КонецЕсли;
					Если НовоеРабочееМесто.ГруппаРабочихМест <> Объект.РабочееМесто.ГруппаРабочихМест Тогда
						Если Не ОбщийМодульСозданиеДокументов.СоздатьВыпускПродукции(Объект.ПроизводственноеЗадание,Объект.РабочееМесто,Объект.Спецификация,Этапы,ДатаЗавершения) Тогда
						Сообщить("Документ выпуска не создан!");
						ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
						Возврат("");
						КонецЕсли; 		
					КонецЕсли;
						Если Не НовоеРабочееМесто.ВозвратнаяТара Тогда					
							Если ЗначениеЗаполнено(НомерВТ) Тогда
							ОбщийМодульВызовСервера.ОчиститьНомерВозвратнойТары(Объект.ПроизводственноеЗадание);					
							КонецЕсли;					
						КонецЕсли;
			Иначе
				Если Объект.ПроизводственноеЗадание.ДокументОснование.Ремонт Тогда
				МестоПередачи = "ремонтнику";	
				Иначе
				МестоПередачи = "на склад линейки";
				КонецЕсли; 
					Если Не ОбщийМодульСозданиеДокументов.СоздатьВыпускПродукции(Объект.ПроизводственноеЗадание,Объект.РабочееМесто,Объект.Спецификация,Этапы,ДатаЗавершения) Тогда
					Сообщить("Документ выпуска не создан!"); 
					ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
					Возврат("");
					КонецЕсли;			
			КонецЕсли;
	НаборЗаписей.Записать();
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(МестоПередачи);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат("");
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗадание(Команда)
	Если ОбщийМодульВызовСервера.ЛинейкаОстановлена(ОбщийМодульВызовСервера.ПолучитьЛинейкуПоРабочемуМесту(Объект.РабочееМесто)) Тогда
	Возврат;
	КонецЕсли;
		Если (Элементы.ВвестиКодDanfoss.Доступность)и(Элементы.ВвестиКодDanfoss.Видимость) Тогда
			Если Не ЗначениеЗаполнено(ОбщийМодульВызовСервера.ПолучитьКодDanfoss(ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПроизводственноеЗадание,"БарКод"))) Тогда
			Сообщить("Введите код Danfoss!");
			Возврат;
			КонецЕсли; 
		КонецЕсли; 
			Если (Элементы.ВвестиMACАдрес.Доступность)и(Элементы.ВвестиMACАдрес.Видимость) Тогда
				Если Не ЗначениеЗаполнено(ОбщийМодульВызовСервера.ПолучитьMACАдрес(ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПроизводственноеЗадание,"БарКод"))) Тогда
				Сообщить("Введите MAC-адрес!");
				Возврат;
				КонецЕсли; 
			КонецЕсли;
МестоПередачи = ЗавершитьЗаданиеНаСервере();
	Если МестоПередачи <> "" Тогда
	ОчиститьСсылкуНаПЗ();
	ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Передайте изделие "+МестоПередачи,БиблиотекаКартинок.Пользователь);
		Если МестоПередачи = "ремонтнику" Тогда
		Предупреждение("Передайте изделие "+МестоПередачи+"!",5,"ВНИМАНИЕ!");
		КонецЕсли; 
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура РабочееМестоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не Объект.ПроизводственноеЗадание.Пустая() Тогда
		Если Вопрос("Задание не завершено. Вы действительно хотите авторизоваться?",РежимДиалогаВопрос.ДаНет,,,"ВНИМАНИЕ!") = КодВозвратаДиалога.Нет Тогда
		СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЭтапов()
СписокЭтапов = Новый СписокЗначений;
	Для каждого ТЧ Из ТаблицаКомплектации Цикл
		Если СписокЭтапов.НайтиПоЗначению(ТЧ.ЭтапСпецификации) = Неопределено Тогда
		СписокЭтапов.Добавить(ТЧ.ЭтапСпецификации);
		КонецЕсли; 
	КонецЦикла;
Возврат(СписокЭтапов);
КонецФункции 

&НаКлиенте
Процедура Ремонт(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.ОформлениеРемонта",Новый Структура("РабочееМесто,ПроизводственноеЗадание,Исполнитель,Этапы",Объект.РабочееМесто,Объект.ПроизводственноеЗадание,Объект.Исполнитель,Этапы));
	Если Результат <> Неопределено Тогда
	ОчиститьСсылкуНаПЗ(); 
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБарКода(Команда)
ОткрытьФорму("Обработка.СозданныеБарКоды.Форма.Форма",Новый Структура("ПЗ,РабочееМесто",Объект.ПроизводственноеЗадание,Объект.РабочееМесто)); 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
тЭлементы = ДеревоСпецификации.ПолучитьЭлементы();
   Для Каждого тСтр Из тЭлементы Цикл
   Элементы.ДеревоСпецификации.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
   КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
тЭлементы = ДеревоСпецификации.ПолучитьЭлементы();
   Для Каждого тСтр Из тЭлементы Цикл
   Элементы.ДеревоСпецификации.Свернуть(тСтр.ПолучитьИдентификатор());
   КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элементы.ДеревоСпецификации.ТекущиеДанные.МПЗ) = Тип("СправочникСсылка.Документация") Тогда
	ОбщийМодульКлиент.ОткрытьФайлДокумента(Элементы.ДеревоСпецификации.ТекущиеДанные.МПЗ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Прошивка(Команда)
СписокЭтапов = Новый СписокЗначений;

СписокЭтапов = ПолучитьСписокЭтапов();
	Если СписокЭтапов.Количество() > 1 Тогда
	ВыбЭтап = СписокЭтапов.ВыбратьЭлемент("Выберите спецификацию");
	Иначе
	ВыбЭтап = СписокЭтапов[0];
	КонецЕсли;
П = Новый Структура("Спецификация",ВыбЭтап.Значение);
ОткрытьФорму("Обработка.ПрошивкаПриборов.Форма",П);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ЗаполнитьДерево(Элемент.ТекущиеДанные.ЭтапСпецификации);
РазвернутьДерево(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ВвестиКодDanfossНаСервере(БарКод)
	Попытка				
	НаборЗаписей = РегистрыСведений.БарКоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПЗ.Установить(Объект.ПроизводственноеЗадание);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(Запись.КодDanfoss) Тогда
			Запись.КодDanfoss = БарКод;
			Иначе
			Сообщить("Код Danfoss уже присвоен данному изделию.");
			Возврат;
			КонецЕсли;  
	    КонецЦикла;
	НаборЗаписей.Записать(Истина);
	КодDanfoss = БарКод;
	Элементы.КодDanfoss.Видимость = Истина;
	Исключение
	Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКодDanfoss(Команда,БарКод = "")
	Если Не ЗначениеЗаполнено(БарКод) Тогда
		Если Не ВвестиСтроку(БарКод,"Введите код Danfoss",8) Тогда
		Возврат;	
		КонецЕсли; 
	КонецЕсли;
ВвестиКодDanfossНаСервере(БарКод);
КонецПроцедуры

&НаСервере
Процедура ВвестиIMEIНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БарКоды.IMEI
	|ИЗ
	|	РегистрСведений.БарКоды КАК БарКоды
	|ГДЕ
	|	БарКоды.IMEI = &IMEI";
Запрос.УстановитьПараметр("IMEI", IMEI);
РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Попытка				
		НаборЗаписей = РегистрыСведений.БарКоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(Объект.ПроизводственноеЗадание);
		НаборЗаписей.Прочитать();
		    Для Каждого Запись Из НаборЗаписей Цикл 
			Запись.IMEI = IMEI; 
		    КонецЦикла;
		НаборЗаписей.Записать();
		Элементы.IMEI.Видимость = Истина;
		Исключение
		Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Иначе	
	Сообщить(IMEI + " - уже зарегистрирован в базе данных!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиIMEI(Команда,КодIMEI = "")
	Если Не ЗначениеЗаполнено(КодIMEI) Тогда
		Если Не ВвестиСтроку(КодIMEI,"Введите IMEI",0) Тогда
		Возврат;
		КонецЕсли; 		
	КонецЕсли;  
		Если Найти(КодIMEI,"IMEI:") > 0 Тогда
		КодIMEI = Сред(КодIMEI,Найти(КодIMEI,"IMEI:")+5);
		IMEI = Лев(КодIMEI,Найти(КодIMEI,";")-1);
		Иначе	
		IMEI = КодIMEI;
		КонецЕсли;
ВвестиIMEIНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВвестиMACАдресНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БарКоды.MAC
	|ИЗ
	|	РегистрСведений.БарКоды КАК БарКоды
	|ГДЕ
	|	БарКоды.MAC = &MAC";
Запрос.УстановитьПараметр("MAC", MAC);
РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Попытка				
		НаборЗаписей = РегистрыСведений.БарКоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(Объект.ПроизводственноеЗадание);
		НаборЗаписей.Прочитать();
		    Для Каждого Запись Из НаборЗаписей Цикл 
			Запись.MAC = MAC; 
		    КонецЦикла;
		НаборЗаписей.Записать();
		Элементы.MAC.Видимость = Истина;
		Исключение
		Сообщить(ОписаниеОшибки());
		КонецПопытки;	
	Иначе	
	Сообщить(MAC + " - уже зарегистрирован в базе данных!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиMACАдрес(Команда,MACАдрес = "")
	Если Не ЗначениеЗаполнено(MACАдрес) Тогда
		Если Не ВвестиСтроку(MACАдрес,"Введите MAC-адрес",12) Тогда
		Возврат;
		КонецЕсли; 		
	КонецЕсли;
MAC = MACАдрес;  
ВвестиMACАдресНаСервере();
КонецПроцедуры
        
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
		Если Массив[0] = "3" Тогда
		ЗначениеПараметра1 = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[1]);
			Если ЗначениеПараметра1 = Неопределено Тогда
			Сообщить("Линейка или место хранения не найдена!");
			Возврат;	
			КонецЕсли; 
		МПЗ = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[3]);
			Если МПЗ = Неопределено Тогда
			Сообщить(Массив[3]+" - МПЗ не найдена!");
			Возврат;	
			КонецЕсли;
				Если ТипЗнч(ЗначениеПараметра1) = Тип("СправочникСсылка.Линейки") Тогда
				МестоХранения = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ЗначениеПараметра1,"МестоХраненияКанбанов");
				Иначе
				МестоХранения = ЗначениеПараметра1;			
				КонецЕсли;
		МестоХраненияОтправитель = ОбщийМодульВызовСервера.ПолучитьМестоХраненияПоКоду(Массив[2]);
		П = Новый Структура("МестоХраненияОтправитель,МестоХраненияКанбанов,МПЗ,НомерЯчейки,Сотрудник",МестоХраненияОтправитель,МестоХранения,МПЗ,Массив[5],Объект.Исполнитель);
		ОткрытьФорму("ОбщаяФорма.ОформлениеПустыхКанбанов",П,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
		СписокДействий = Новый СписокЗначений;

		СписокДействий.Добавить(1,"Записать код Danfoss");
		СписокДействий.Добавить(2,"Записать IMEI"); 
		СписокДействий.Добавить(3,"Записать MAC-адрес");
		Действие = 1;
		Действие = СписокДействий.ВыбратьЭлемент("Выберите действие",Действие);
			Если Действие.Значение = 1 Тогда
				Если ОбщийМодульВызовСервера.ТребуетсяКодDanfoss(Объект.ПроизводственноеЗадание) Тогда
				ВвестиКодDanfoss(Неопределено,СокрЛП(Данные));
				Иначе
				Сообщить("Для выбранного изделия не требуется ввод кода Danfoss!");
				КонецЕсли; 
			ИначеЕсли Действие.Значение = 2 Тогда
				Если ОбщийМодульВызовСервера.ТребуетсяIMEI(Объект.ПроизводственноеЗадание) Тогда
				ВвестиIMEI(Неопределено,СокрЛП(Данные));
				Иначе
				Сообщить("Для выбранного изделия не требуется ввод IMEI!");
				КонецЕсли;
			ИначеЕсли Действие.Значение = 3 Тогда 
				Если ОбщийМодульВызовСервера.ТребуетсяMACАдрес(Объект.ПроизводственноеЗадание) Тогда
				ВвестиMACАдрес(Неопределено,СокрЛП(Данные));
				Иначе
				Сообщить("Для выбранного изделия не требуется ввод MAC-адреса!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьНедостачу(Команда)
	Если ОбщийМодульАРМКлиент.ОформитьНедостачу(ЭтаФорма,Объект.РабочееМесто,Объект.ПроизводственноеЗадание) Тогда
	ОчиститьСсылкуНаПЗ();
	КонецЕсли; 
КонецПроцедуры
